Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType
Defines the Cast Unit Drawing Creation type.

Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType.CastUnitDrawingByPosition
Creating the Cast Unit drawing by Position means we follow the position of the cast unit.

Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType.CastUnitDrawingById
Creating the Cast Unit drawing by Id means we follow the id of the cast unit.